# -*- coding: utf-8 -*-
import time
import vk_api
import requests
from vk_api.longpoll import VkLongPoll, VkEventType
from threading import Thread
sessions = requests.Session()


def captcha_handler(captcha):
    """ При возникновении капчи вызывается эта функция и ей передается объект
        капчи. Через метод get_url можно получить ссылку на изображение.
        Через метод try_again можно попытаться отправить запрос с кодом капчи
    """

    key = input("Enter captcha code {0}: ".format(captcha.get_url())).strip()

    # Пробуем снова отправить запрос с капчей
    return captcha.try_again(key)

def spam(token , a):
    vk_session = vk_api.VkApi(token  = token , captcha_handler=captcha_handler )

    #vk_session = vk_api.VkApi(token = token)       #Авторизация через токен фейка

    longpoll = VkLongPoll(vk_session)
    
    vk = vk_session.get_api()
    while True:
        vk.messages.send(
            #user_id = "133064272",     #Арина
            #user_id = "98398554",      #Дима
            #user_id = "218125821",     #Оля
            #user_id = "299098695",     #ya
            user_id = "160259470" ,
            message = "Верни ХЕЙНИКЕН и поправляйся давай",
            attachment = "audio135866784_456239025",
            random_id = ""
            )
        time.sleep(5)
token1 = 
run1 = Thread(target=spam, args = (token1, 'Верни ХЕЙНИКЕН и поправляйся давай')) 
run1.start()
#################################################################################################
#################################################################################################
#################################################################################################
token2 = 
run2 = Thread(target=spam, args = (token1, 'Верни ХЕЙНИКЕН и поправляйся давай')) 
run2.start()
#################################################################################################
#################################################################################################
#################################################################################################
run3 = 
run3 = Thread(target=spam, args = (token1, 'Верни ХЕЙНИКЕН и поправляйся давай')) 
run3.start()
#################################################################################################
#################################################################################################
#################################################################################################
token4 = 
run4 = Thread(target=spam, args = (token1, 'Верни ХЕЙНИКЕН и поправляйся давай')) 
run4.start()
